cmsis-svd/cmsis-svd/data/HDSC/HC32L156JX.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="CT0_RT">
            <name>CT1_RT</name>
            <description>desc CT_RT</description>
            <baseAddress>0x40025040</baseAddress>
            <alternatePeripheral>CT1_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CT0_RT">
            <name>CT2_RT</name>
            <description>desc CT_RT</description>
            <baseAddress>0x40025080</baseAddress>
            <alternatePeripheral>CT2_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CT0_RT">
            <name>CT3_RT</name>
            <description>desc CT_RT</description>
            <baseAddress>0x400250C0</baseAddress>
            <alternatePeripheral>CT3_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CT0_RT">
            <name>CT4_RT</name>
            <description>desc CT_RT</description>
            <baseAddress>0x40025200</baseAddress>
            <alternatePeripheral>CT4_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CT0_RT">
            <name>CT5_RT</name>
            <description>desc CT_RT</description>
            <baseAddress>0x40025240</baseAddress>
            <alternatePeripheral>CT5_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CT0_RT">
            <name>CT6_RT</name>
            <description>desc CT_RT</description>
            <baseAddress>0x40025280</baseAddress>
            <alternatePeripheral>CT6_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CT0_RT">
            <name>CT7_RT</name>
            <description>desc CT_RT</description>
            <baseAddress>0x400252C0</baseAddress>
            <alternatePeripheral>CT7_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>DTIM1</name>
            <description>desc DTIM</description>
            <baseAddress>0x40015000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
            <registers>
                <register>
                    <name>TIMERLOAD</name>
                    <description>desc TIMERLOAD</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>TIMERVALUE</name>
                    <description>desc TIMERVALUE</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>TIMERCTRL</name>
                    <description>desc TIMERCTRL</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x20</resetValue>
                    <resetMask>0xEF</resetMask>
                    <fields>
                        <field>
                            <name>ONESHOT</name>
                            <description>desc ONESHOT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRSIZE</name>
                            <description>desc TMRSIZE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRPRE</name>
                            <description>desc TMRPRE</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTEN</name>
                            <description>desc INTEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRMODE</name>
                            <description>desc TMRMODE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMREN</name>
                            <description>desc TMREN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERINTCLR</name>
                    <description>desc TIMERINTCLR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>TIMERRIS</name>
                    <description>desc TIMERRIS</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>TMRINTST</name>
                            <description>desc TMRINTST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERMIS</name>
                    <description>desc TIMERMIS</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>TMRMINTST</name>
                            <description>desc TMRMINTST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERBGLOAD</name>
                    <description>desc TIMERBGLOAD</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
