cmsis-svd/cmsis-svd/data/HDSC/HC32L156JX.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>UID</name>
            <description>desc UID</description>
            <baseAddress>0x40000200</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC</size>
            </addressBlock>
            <registers>
                <register>
                    <name>UIDR0</name>
                    <description>desc UIDR0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>UID</name>
                            <description>desc UID</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UIDR1</name>
                    <description>desc UIDR1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>UID</name>
                            <description>desc UID</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UIDR2</name>
                    <description>desc UIDR2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>UID</name>
                            <description>desc UID</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>VC</name>
            <description>desc VC</description>
            <baseAddress>0x4003C300</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x74</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CTL1</name>
                    <description>desc CTL1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x2000</resetValue>
                    <resetMask>0xFF3F</resetMask>
                    <fields>
                        <field>
                            <name>VC_EN</name>
                            <description>desc VC_EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC_OUT</name>
                            <description>desc VC_OUT</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VC_NMODE</name>
                            <description>desc VC_NMODE</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC_PMODE</name>
                            <description>desc VC_PMODE</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCVOL_SEL</name>
                            <description>desc VCVOL_SEL</description>
                            <msb>13</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCDIV_EN</name>
                            <description>desc VCDIV_EN</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCDIV_SEL</name>
                            <description>desc VCDIV_SEL</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL2</name>
                    <description>desc CTL2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF</resetMask>
                    <fields>
                        <field>
                            <name>VC_FILTER_EN</name>
                            <description>desc VC_FILTER_EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC_RESPONSE</name>
                            <description>desc VC_RESPONSE</description>
                            <msb>3</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC_EXBUF</name>
                            <description>desc VC_EXBUF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCINT_FALLING</name>
                            <description>desc VCINT_FALLING</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCINT_RISING</name>
                            <description>desc VCINT_RISING</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCINT_HIGH</name>
                            <description>desc VCINT_HIGH</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC2PT</name>
                            <description>desc VC2PT</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCIE</name>
                            <description>desc VCIE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCIF</name>
                            <description>desc VCIF</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC_HYS_SEL</name>
                            <description>desc VC_HYS_SEL</description>
                            <msb>12</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL3</name>
                    <description>desc CTL3</description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF5</resetMask>
                    <fields>
                        <field>
                            <name>VC_TM0G</name>
                            <description>desc VC_TM0G</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC_TM2G</name>
                            <description>desc VC_TM2G</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCIN_NEG_SEL</name>
                            <description>desc VCIN_NEG_SEL</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCIN_POS_SEL</name>
                            <description>desc VCIN_POS_SEL</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
